SH = { 
    "መስከረም": {
      1: ["እንቁለጣትሽ"],
      17: ["መስቀል"],
    },
    "ታህሳስ": {
      29: ["ገና"]
    },
    "ጥር": {
      10: ["ከተራ"],
      11: ["ጥምቀት"],
    }
}

YH = { 
    "መስከረም": {
      1: ["ራጉኤል", "ዮሐንስ"],
      9: ["አባ አትናስዮስ (እረፍቱ)"], 
      15: ["ቅዱስ እስጢፋኖስ"],
      17: ["ፀደኒያ ማርያም"],
      21: ["መናገሻ ማርያም"],
      29: ["ቅድስት አርሴማ"]
    },
    "ጥቅምት": {
      5: ["አቡነ ገብረ መንፈስ ቅዱስ"],
      17: ["ቅዱስ እስጢፋኖስ"],
      19: ["አቡነ ሓራ ድንግል"],
      22: ["ሉቃስ"],
      25: ["አቡነ ሀቢብ"],
      29: ["መህኃኒአለም"]
    },
 
    "ህዳር": {
      6: ["ቁስቋም ማርያም"],
      8: ["ኪሩቤል"],
      11: ["ሃና ወኢያቄም"],
      12: ["ቅዱስ ሚካኤል"],
      13 :["እግዚአብሔር ለአብ"] ,
      18: ["ፊሊጶስ ሐዋሪያ"],
      21 : ["ቅድስት ድንግል ማርያም"],
      24 :["፳፬ቱ ካህናት ሰማይ"],
      25: ["መርቆሪዮስ"],
      26: ["አቡነ ሀብትማርያም"]
    },
    "ታህሳስ": {
      1 : ["ኤልያስ"],
      4 : ["ሀዎርያው እንድርያስ"],
      6: ["አርሴማ","ኢያሱ"],
      12:["አባ ሳሙኤል"],
      13: ["ቅዱስ ሩፋኤል"],
      19: ["ቅዱስ ገብርኤል"],
      22: ["ብስራተ ገብርኤል"],
      24: ["አቡነ ተክል ሀይማኖት"],
      28: ["አማኑኤል"],
      29: ["በአለ ወልድ"]
    },
    "ጥር": {
      4: ["ዮሐንስ ወልደ ነጎድጓድ(የአመቱ)"],
      6: ["ኢየሱስ"],
      7: ["አጋዕዝተ ዓለም ስላሴ(የአመቱ)"],
      11: ["አቡነ ሓራ ድንግል(የአመቱ)"],
      12: ["ቅዱስ ሚካኤል(የአመቱ)"],
      13: ["ቅዱስ ሩፋኤል(የአመቱ)"],
      15: ["ቂርቆስ ወኢየሉጣ(የአመቱ)"],
      21: ["ቅድስት ድንግል ማርያም(የአመቱ)"],
      22: ["ቅዱስ ዑራኤል(የአመቱ)"],
      24: ["አቡነ ተክለ ሃይማኖት(የአመቱ)"],
      28: ["አማኑኤል(የአመቱ)"]
    },
    "የካቲት": {
      14: ["አቡነ አረጋዊ(የአመቱ)"],
      16: ["ኪዳነ ምህረት(የአመቱ)"],
      23: ["ፈረሰኛው ቅዱስ ጊዮርጊስ(የአመቱ)"],
      26: ["ሆሴ ነቢይ"]
    },
    "መጋቢት": {
      10: ["መስቀለ ክርስቶስ"],
      27: ["መድኃኔ ዓለም"],
      29: ["በዓለ ወልድ"]
    },
    "ሚያዝያ": {
      23: ["ፈረሰኛው ቅዱስ ጊዮርጊስ(እረፍቱ)"],
      27: ["መድኃኔ ዓለም"],
      30: ["ቅዱስ ማርቆስ ወንገላዊ"]
    },
    "ግንቦት": {
      1: ["ልደታ ለማርያም"],
      11: ["አቡነ ሓራ ድንግል", "ቅዱስ ያሬድ"],
      12: ["ክርስቶስ ሠምራ"],
      14: ["አቡነ አረጋዊ"],
      21: ["ቅድስት ድንግል ማርያም"],
      28: ["አማኑኤል"]
    },
    "ሰኔ": {
      12: ["ቅዱስ ሚካኤል"],
      17: ["አቡነ ገሪማ"],
      20: ["ሕንጸተ ቤተ ክርስትያን", "ዮሐንስ ሃጺር"],
      30: ["መጥምከ መለኮት ዮሐንስ"]
    },
    "ሐምሌ": {
      2: ["ታድዮስ ሐዋርያ"],
      3: ["ዜና ማርቆስ"],
      4: ["አባ መቃርዮስ"],
      5: ["ጴጥሮስ ወጳውሎስ", "አቡነ ገብረ መንፈስ ቅዱስ"],
      7: ["አጋዕዝተ አለም ስላሴ"],
      8: ["አባ ኪሮስ"],
      19: ["ቅዱስ ገብርኤል"],
      22: ["ቅዱስ ዑራኤል"],
      23: ["ፈረሰኛው ቅዱስ ጊዮርጊስ"],
      26: ["አረጋዊው ዮሰፍ"]
    },
    "ነሐሴ": {
      16: ["ኪዳነ ምህረት"],
      13: ["እግዚአብሔር አብ"],
      21: ["ቅድስት ድንግል ማርያም"],
      24: ["አቡነ ተክለ ሃይማኖት"],
      28: ["አብርሃም ይስሐቅ ያዕቆብ"]
    },
    "ጳጉሜ":{
      3: ["ቅዱስ ሩፋኤል"]
    }
}

GH = {
  1: ["ልደታ", "ራጉኤል", "ኤልያስ", "ዮሐንስ", "እዮብ", "ሶሰና", "ሐዋርያው በርተሎሜዎስ"],
  2: ["ታድዮስ ሐዋርያ", "ኢዮብ ጻዲቅ", "አባ ጉባ", "በርቶሎሜዎስ", "ጴጥሮስ", "አባ መሪና"],
  3: ["በአታ ለማርያም", "ዜና ማርቆስ", "ነአኩቶ ለአብ", "ቅዱስ ፋኑኤል"],
  4: ["ዮሐንስ ወልደ ነጎድጓድ", "ሐዋርያው እንድርያስ", "አባ መቃርዮስ", "አባ አብርሐ"],
  5: ["ጴጥሮስ ወጳውሎስ", "አቡነ ገብረ መንፈስ ቅዱስ", "አቡነ አሮን"],
  6: ["ቁስቋም ማርያም", "አርሴማ", "እያሱ"],
  7: ["አጋዚተ አለም ስላሴ", "አብላዮናስ", "ዲዮስቆሮስ","ፊሊሞና"],
  8: ["አባ ኪሮስ", "ዮልያኖስ", "ዘካርያስ","ሐዋርያው ማትያስ","ኪሩቤል አርባዕቱ እንስሳ"],
  9: ["አባ አትናስዮስ(እረፍቱ)", "ቶማስ ሐዋርያ", "እንድርያስ ሐዋርያ", "አውሳብዮስ", "አባ ሰማእታት", "ሰልስቱ ምዕት", "አቡነ እስትንፋሰ ክርስቶስ", "አትናትዮስ"],
  10: ["መስቀለ ክርስቶስ", "ስምኦን ቀኖናዊ ሐዋርያ", "ጼደንያ ማርያም", "ናትናኤል ሐዋርያ"],
  11: ["ሃና ወኢያቄም", "ፋሲለደስ ሰማዕት", "ቅዱስ ያሬድ", "አቡነ ሐራ ድንግል"],
  12: ["ቅዱስ ሚካኤል", "ክርስቶስ ሰምራ", "ሐዋርያ ማቴዎስ", "አባ ሳሙኤል"],
  13: ["እግዚአብሔር አብ", "ኪዱስ ሩፋኤል", "አቡነ ዘርአ ቡሩክ", "ፀጋ ኢየሱስ"],
  14: ["አቡነ አረጋዊ", "አቡነ ገብረ ክርስቶስ", "ድምጥያኖስ ሰማዕት", "ገብረ መርአዊ", "ዘሚካኤል", "ሙሴ ፀሊም"],
  15: ["ቅዱስ እስጢፋኖስ", "ቂርቆስ ወኢየሉጣ", "ሰልፋኮስ", "ሚናስ"],
  16: ["ኪዳነ ምሕረት", "ሚካኤል ጳጳስ", "እልሳቤጥ"],
  17: ["ፀደኒያ ማርያም", "ቅዱስ እስጢፋኖስ", "ሉቃስ ዘዓምደብርሃን", "አባ ገሪማ", "ሐዋርያ ያዕቆብ ወልደ ዘብዴዎስ", "ወለተ ጴጥሮስ", "አቡነ በትረማርያም", "ሙሴ"],
  18: ["ፊሊጶስ ሐዋርያ", "ኤስድሮስ ሰማዕት", "ኤዎስጣጤዎስ ሰማዕት"],
  19: ["ቅዱስ ገብርኤል", "አርቃዲዎስ", "ሰለስቱ ደቂቅ", "ይምርሐነ ክርስቶስ"],
  20: ["ጽንሰታ ለማርያም", "ነብዩ ኤልሳዕ", "ሐጌ ነብይ", "አባ ሰላማ መተርጉም", "ሕንፀተ ቤተ ክርስትያን", "ዮሐንስ ሐፂር"],
  21: ["አቡነ አምደ ስላሴ", "አቡነ ምዕመነ ድንግል", "በአለ እግዝእትነ ማርያም"],
  22: ["ቅዱስ ኡራኤል", "ያዕቆብ ዘምስራቅ", "ድቅስዮስ", "ብስራተ ገብርኤል", "ሉቃስ"],
  23: ["ቅዱስ ጊዮርጊስ", "ለጊዮስ ሰማዕት", "ቅዱስ ዳንኤል ነቢይ"],
  24: ["አቡነ ተክለ ሃይማኖት", "እስራ ወ አርባዕቱ ካህናተ ሰማይ", "ጎርጎርዮስ", "ክርስቶስ ሰምራ"],
  25: ["መርቆሬዎስ", "አኒፍኖስ", "አቡነ ሀቢብ"],
  26: ["ሆሰዕ ነቢይ", "ሳዶቅ ሰማዕት", "አቡነ ሀብት ማርያም", "አቡነ ሰላማ ከሳቴ ብርሃን", "አባ ኢየሱስ ሞአ", "አረጋዊው ዮሴፍ", "ቶማስ ዘህንደኬ"],
  27: ["መድኃኔ ዓለም", "ሕዝቂያስ ነብይ", "አባ ዮሐንስ", "አቡነ መባ ፅዮን"],
  28: ["አማኑኤል", "ቆስጠንጢኖስ", "አብርሃም ይስሐቅ ያዕቆብ"],
  29: ["ቅድስት አርሴማ", "በአለ ወልድ", "ሳሙኤል ዘጋስጫ", "ቅዱስ ላልይበላ"],
  30: ["መጥምቀ መለኮት ዮሃንስ", "ቅዱስ ማርቆስ ወንጌላዊ"],
}
geeze_numbers = ['፩', '፪', '፫', '፬', '፭', '፮', '፯', '፰', '፱', '፲', '፲፩', '፲፪', '፲፫', '፲፬', '፲፭', '፲፮', '፲፯', '፲፰', '፲፱', '፳', '፳፩', '፳፪', '፳፫', '፳፬', '፳፭', '፳፮', '፳፯', '፳፰', '፳፱', '፴']

Teaching_epi = list()